analyze -library WORK -format vhdl {../netlist/datatype.vhd ../netlist/filter.vhd}
elaborate FILTER -architecture BEH -library work 
#max clock 2
create_clock -name my_clk -period 2 clk
set_dont_touch_network my_clk
compile -exact_map
report_timing > report/clk_1_time.txt
report_area > report/clk_1_area.txt

create_clock -name my_clk -period 8 clk
set_dont_touch_network my_clk
compile -exact_map
report_timing > report/clk_1_4_time.txt
report_area > report/clk_1_4_area.txt
ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/myfir.sdf
write -f verilog -hierarchy -output ../netlist/myfir.v
write_sdc ../netlist/myfir.sdc
